pages/5_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The art of redirection</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The art of redirection</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-LinuxIntro">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Typing commands in the terminal leads to the result being shown on the terminal window. It doesn't have to be this way, though. We could redirect the output to somewhere else instead.
</li>
<li>In the 1970's, users may have wanted to output to a line printer instead.
</li>
<li>This doesn't tend to come up much in the 21st century, but you might want to put the output from the computer into a file, though.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Try this command:
</li>
</ul>
<pre class="example">
echo "This is some text"
</pre>
<ul class="org-ul">
<li><code>echo</code> simply prints some text to the display.
</li>
<li>By itself, this isn't very useful. We can use this to create and add content to text files, though.
</li>
</ul>
<pre class="example">
echo "This is some text." &gt; whatsit.txt
echo "This is a bit more text." &gt; whatsit.txt
</pre>
<ul class="org-ul">
<li>If you look, you'll see you just created a new file.
</li>
<li>If you do <code>cat whatsit.txt</code> or <code>emacs whatsit.txt</code> or even nano <code>whatsit.txt</code> you'll see the contents of the file.
</li>
<li>The redirect symbol <code>&gt;</code> tells Linux to put the result of whatever command comes before it into a new file. Unfortunately, this means over-writing the contents of the first <code>echo</code> command we did.
</li>
<li>Try this. <b>It's subtly different.</b>
</li>
</ul>
<pre class="example">
echo "This is some new text." &gt; whatsit.txt
echo "This is a little bit more text." &gt;&gt; whatsit.txt
</pre>
<ul class="org-ul">
<li>This time, in the second line we used <code>&gt;&gt;</code> instead of <code>&gt;</code>. This means to <b>append</b> (as in 'add to the end of') the file, rather than making a fresh one each time.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>On a Linux machine, you can type <code>history</code> to see (up to) the last 500 commands you've entered. Try it now.
</li>
<li>It'd be nice to keep this to have a record of what you've done in the past. I've been using Linux for a while, and still look over my own history from time to time; it's handy to refer back to.
</li>
<li><b>Task:</b> Redirect the contents of the history command into a file called <code>recentHistory.txt</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 try">
<h3 id="sec-1-4">Learn It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Your <code>recentHistory.txt</code> file probably has quite a lot in it.
</li>
<li>In Linux, files can get very big, very fast.
</li>
<li>To see the first 10 lines in any file, use the <code>head</code> program, like this:
<ul class="org-ul">
<li><code>head recentHistory.txt</code>
</li>
</ul>
</li>
<li>What do you suppose the <code>tail</code> program does when you give it a file?
</li>
<li><b>Task:</b> Find out what <code>tail</code> does.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Pipe It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>To be a proper Linux pro, you'll want to start using pipes.
</li>
<li>The basic idea is that you run a program, then pass the results to another program (and maybe another and another&#x2026;)
</li>
<li>Being able to do this makes Linux incredibly powerful, especially if you're quite creative.
</li>
<li>Let's try an example: You're running out of space on your computer, and you want to know which files are taking up the most room so you can delete them.
</li>
<li>The <code>du</code> command tells you how much disk space every file and sub-directory is using from wherever you are on the computer.
</li>
<li>If you're in <code>/</code> (the root) when you start, you'll see the details for EVERY file on the computer.
</li>
<li>Give it a go, and use Ctrl-c to kill the program when you get bored.
</li>
<li>By itself, this gives an overwhelming amount of information, presented in ascending (smallest to largest) order.
</li>
</ul>


<ul class="org-ul">
<li>The <code>sort</code> command takes any file and sorts it into either asecending or descending order. By putting -nr on the end of the command, we ask the <code>sort</code> program to use numeric values (<code>n</code>) and reverse (<code>r</code>) the sort order. 
</li>
<li>In our quest to find the largest files on the system, at least they'll appear in the right order now, although there are likely to be millions of files.
</li>
<li>Try it: <code>du | sort -nr</code>
</li>
<li>This time, there will be a bit of a delay while the computer browses the files availble and sorts them, then your files will be output. 
</li>
</ul>


<ul class="org-ul">
<li>Finally, we can take this output and just ask to see the first 10 results by piping the output through <code>head</code>.
</li>
<li>Our command is now: <code>du | sort -nr | head</code>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 badge">
<h3 id="sec-1-6">Badge It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><b>Silver:</b> 
</li>
<li><b>Gold:</b> 
</li>
<li><b>Platinum:</b> 
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
